In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [9]:
df['col2'].nunique()
#유니크한 row 의 갯수를 출력

3

In [10]:
#위 nunique()메소드를 쓰지 않고, 유니크한 row 갯수를 출력하도록 코딩
len(df['col2'].unique())

3

In [11]:
df['col2'].value_counts

<bound method IndexOpsMixin.value_counts of 0    444
1    555
2    666
3    444
Name: col2, dtype: int64>

In [25]:
df1 = pd.DataFrame({'학생번호':[1,2,3,4,5,6,7,8],
                    '좋아하는 간식':['햄버거','피자','김밥','햄버거','샐러드','떡볶이','샐러드','샐러드'],
                    '좋아하는 색깔':['red','blue','blue','yellow','blue','violet','yellow','red']})
df1

   학생번호 좋아하는 간식 좋아하는 색깔
0     1     햄버거     red
1     2      피자    blue
2     3      김밥    blue
3     4     햄버거  yellow
4     5     샐러드    blue
5     6     떡볶이  violet
6     7     샐러드  yellow
7     8     샐러드     red

In [17]:
df1['좋아하는 간식'].value_counts()

샐러드    3
햄버거    2
피자     1
김밥     1
떡볶이    1
Name: 좋아하는 간식, dtype: int64

In [18]:
df1['좋아하는 색깔'].value_counts()

blue      3
red       2
yellow    2
violet    1
Name: 좋아하는 색깔, dtype: int64

In [21]:
newdf = df

In [23]:
newdf

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [24]:
newdf[(newdf['col1'] > 2)&(newdf['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [26]:
def a(var):
    return var*2

In [27]:
a(df['col1'])

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [28]:
def times2(x):
    return x*2

In [29]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [30]:
def hong2(i):
    return len(i)
df['col3'].apply(hong2)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [31]:
df1['좋아하는 간식'].apply(len)

0    3
1    2
2    2
3    3
4    3
5    3
6    3
7    3
Name: 좋아하는 간식, dtype: int64

In [39]:
#df.drop('col1',axis = 1)
del df ['col1']
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [40]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [41]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [42]:
df.sort_values(by = 'col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [43]:
df == False

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [45]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [46]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [58]:
df3 = pd.DataFrame({'col1':[1.0,2.0,3.0,np.nan],
                    'col2':[np.nan,555.0,666.0,444.0],
                    'col3':['abc','def','ghi','xyz']})
df3.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [59]:
df3.fillna('없음')

  col1   col2 col3
0  1.0     없음  abc
1  2.0  555.0  def
2  3.0  666.0  ghi
3   없음  444.0  xyz

In [60]:
df3.fillna(value='없음')

  col1   col2 col3
0  1.0     없음  abc
1  2.0  555.0  def
2  3.0  666.0  ghi
3   없음  444.0  xyz

In [63]:
df3.fillna(df3[['col1','col2']].mean())

   col1   col2 col3
0   1.0  555.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   2.0  444.0  xyz

In [66]:
df4 = pd.DataFrame({'A':['인문','인문','인문','정보','정보','정보'],
                   'B':['1학년','1학년','2학년','2학년','1학년','1학년'],
                   'C':['여','남','여','남','여','남'],
                   'D':[90,80,75,50,100,40]})
df4

    A    B  C    D
0  인문  1학년  여   90
1  인문  1학년  남   80
2  인문  2학년  여   75
3  정보  2학년  남   50
4  정보  1학년  여  100
5  정보  1학년  남   40

In [69]:
df4.pivot_table(values = 'D',index = ['A','B'],columns = ['C'])

C          남      여
A  B
인문 1학년  80.0   90.0
   2학년   NaN   75.0
정보 1학년  40.0  100.0
   2학년  50.0    NaN